zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_GLOBAL.h
/** Number of instances of the ENETC_GLOBAL module. */
#define ENETC_GLOBAL_INSTANCE_COUNT              (1u)

/* ENETC_GLOBAL - Peripheral instance base addresses */
/** Peripheral NETC__ENETC0_GLOBAL base address */
#define IP_NETC__ENETC0_GLOBAL_BASE              (0x6D0A0000u)
/** Peripheral NETC__ENETC0_GLOBAL base pointer */
#define IP_NETC__ENETC0_GLOBAL                   ((ENETC_GLOBAL_Type *)IP_NETC__ENETC0_GLOBAL_BASE)
/** Array initializer of ENETC_GLOBAL peripheral base addresses */
#define IP_ENETC_GLOBAL_BASE_ADDRS               { IP_NETC__ENETC0_GLOBAL_BASE }
/** Array initializer of ENETC_GLOBAL peripheral base pointers */
#define IP_ENETC_GLOBAL_BASE_PTRS                { IP_NETC__ENETC0_GLOBAL }

/* ----------------------------------------------------------------------------
   -- ENETC_GLOBAL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_GLOBAL_Register_Masks ENETC_GLOBAL Register Masks
 * @{
 */

/*! @name SMCAPR - Shared memory capability register */
/*! @{ */

#define ENETC_GLOBAL_SMCAPR_NUM_WORDS_MASK       (0xFFFFFFU)
#define ENETC_GLOBAL_SMCAPR_NUM_WORDS_SHIFT      (0U)
#define ENETC_GLOBAL_SMCAPR_NUM_WORDS_WIDTH      (24U)
#define ENETC_GLOBAL_SMCAPR_NUM_WORDS(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMCAPR_NUM_WORDS_SHIFT)) & ENETC_GLOBAL_SMCAPR_NUM_WORDS_MASK)
/*! @} */

/*! @name SMDTR - Shared memory depletion threshold register */
/*! @{ */

#define ENETC_GLOBAL_SMDTR_THRESH_MASK           (0xFFFFFFU)
#define ENETC_GLOBAL_SMDTR_THRESH_SHIFT          (0U)
#define ENETC_GLOBAL_SMDTR_THRESH_WIDTH          (24U)
#define ENETC_GLOBAL_SMDTR_THRESH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMDTR_THRESH_SHIFT)) & ENETC_GLOBAL_SMDTR_THRESH_MASK)
/*! @} */

/*! @name SMACR - Shared memory available count register */
/*! @{ */

#define ENETC_GLOBAL_SMACR_COUNT_MASK            (0xFFFFFFU)
#define ENETC_GLOBAL_SMACR_COUNT_SHIFT           (0U)
#define ENETC_GLOBAL_SMACR_COUNT_WIDTH           (24U)
#define ENETC_GLOBAL_SMACR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMACR_COUNT_SHIFT)) & ENETC_GLOBAL_SMACR_COUNT_MASK)
/*! @} */

/*! @name SMCLWMR - Shared memory count low watermark register */
/*! @{ */

#define ENETC_GLOBAL_SMCLWMR_WATERMARK_MASK      (0xFFFFFFU)
#define ENETC_GLOBAL_SMCLWMR_WATERMARK_SHIFT     (0U)
#define ENETC_GLOBAL_SMCLWMR_WATERMARK_WIDTH     (24U)
#define ENETC_GLOBAL_SMCLWMR_WATERMARK(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMCLWMR_WATERMARK_SHIFT)) & ENETC_GLOBAL_SMCLWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMBUCR - Shared memory buffer unassigned count register */
/*! @{ */

#define ENETC_GLOBAL_SMBUCR_COUNT_MASK           (0xFFFFFFU)
#define ENETC_GLOBAL_SMBUCR_COUNT_SHIFT          (0U)
#define ENETC_GLOBAL_SMBUCR_COUNT_WIDTH          (24U)
#define ENETC_GLOBAL_SMBUCR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMBUCR_COUNT_SHIFT)) & ENETC_GLOBAL_SMBUCR_COUNT_MASK)
/*! @} */

/*! @name SMBUCHWMR - Shared memory buffer unassigned count high watermark register */
/*! @{ */

#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK_MASK    (0xFFFFFFU)
#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT   (0U)
#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK_WIDTH   (24U)
#define ENETC_GLOBAL_SMBUCHWMR_WATERMARK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMBUCHWMR_WATERMARK_SHIFT)) & ENETC_GLOBAL_SMBUCHWMR_WATERMARK_MASK)
/*! @} */

/*! @name SMLCR - Shared memory loss count register */
/*! @{ */

#define ENETC_GLOBAL_SMLCR_COUNT_MASK            (0xFFFFFFU)
#define ENETC_GLOBAL_SMLCR_COUNT_SHIFT           (0U)
#define ENETC_GLOBAL_SMLCR_COUNT_WIDTH           (24U)
#define ENETC_GLOBAL_SMLCR_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMLCR_COUNT_SHIFT)) & ENETC_GLOBAL_SMLCR_COUNT_MASK)

#define ENETC_GLOBAL_SMLCR_IFLC_MASK             (0x40000000U)
#define ENETC_GLOBAL_SMLCR_IFLC_SHIFT            (30U)
#define ENETC_GLOBAL_SMLCR_IFLC_WIDTH            (1U)
#define ENETC_GLOBAL_SMLCR_IFLC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMLCR_IFLC_SHIFT)) & ENETC_GLOBAL_SMLCR_IFLC_MASK)

#define ENETC_GLOBAL_SMLCR_IFDC_MASK             (0x80000000U)
#define ENETC_GLOBAL_SMLCR_IFDC_SHIFT            (31U)
#define ENETC_GLOBAL_SMLCR_IFDC_WIDTH            (1U)
#define ENETC_GLOBAL_SMLCR_IFDC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMLCR_IFDC_SHIFT)) & ENETC_GLOBAL_SMLCR_IFDC_MASK)
/*! @} */

/*! @name HBTCAPR - Hash bucket table capability register */
/*! @{ */

#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK    (0xFFFFU)
#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT   (0U)
#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_WIDTH   (16U)
#define ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_SHIFT)) & ENETC_GLOBAL_HBTCAPR_NUM_ENTRIES_MASK)

#define ENETC_GLOBAL_HBTCAPR_MAX_COL_MASK        (0x7000000U)
#define ENETC_GLOBAL_HBTCAPR_MAX_COL_SHIFT       (24U)
#define ENETC_GLOBAL_HBTCAPR_MAX_COL_WIDTH       (3U)
#define ENETC_GLOBAL_HBTCAPR_MAX_COL(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTCAPR_MAX_COL_SHIFT)) & ENETC_GLOBAL_HBTCAPR_MAX_COL_MASK)

#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS_MASK     (0xF0000000U)
#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT    (28U)
#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS_WIDTH    (4U)
#define ENETC_GLOBAL_HBTCAPR_MAX_VISITS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTCAPR_MAX_VISITS_SHIFT)) & ENETC_GLOBAL_HBTCAPR_MAX_VISITS_MASK)
/*! @} */

/*! @name HBTOR0 - Hash bucket table operational register 0 */
/*! @{ */

#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_MASK     (0xFFFFU)
#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT    (0U)
#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_WIDTH    (16U)
#define ENETC_GLOBAL_HBTOR0_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_SHIFT)) & ENETC_GLOBAL_HBTOR0_NUM_ENTRIES_MASK)

#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_MASK     (0xFFFF0000U)
#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_SHIFT    (16U)
#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_WIDTH    (16U)
#define ENETC_GLOBAL_HBTOR0_HWM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_SHIFT)) & ENETC_GLOBAL_HBTOR0_HWM_ENTRIES_MASK)
/*! @} */

/*! @name HBTOR2 - Hash bucket table operational register 2 */
/*! @{ */

