zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_GLOBAL.h
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_MASK   (0xFFU)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_SHIFT  (0U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_WIDTH  (8U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_SHIFT)) & ENETC_GLOBAL_HBTOR2_RUN_AVG_FRACT_MASK)

#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_MASK     (0xFF00U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_SHIFT    (8U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_WIDTH    (8U)
#define ENETC_GLOBAL_HBTOR2_RUN_AVG_INT(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_SHIFT)) & ENETC_GLOBAL_HBTOR2_RUN_AVG_INT_MASK)

#define ENETC_GLOBAL_HBTOR2_HWM_COL_MASK         (0xF0000U)
#define ENETC_GLOBAL_HBTOR2_HWM_COL_SHIFT        (16U)
#define ENETC_GLOBAL_HBTOR2_HWM_COL_WIDTH        (4U)
#define ENETC_GLOBAL_HBTOR2_HWM_COL(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HBTOR2_HWM_COL_SHIFT)) & ENETC_GLOBAL_HBTOR2_HWM_COL_MASK)
/*! @} */

/*! @name SMERBCAPR - Shared memory ENETC receive buffer capability register */
/*! @{ */

#define ENETC_GLOBAL_SMERBCAPR_THRESH_MASK       (0xFFFFFFU)
#define ENETC_GLOBAL_SMERBCAPR_THRESH_SHIFT      (0U)
#define ENETC_GLOBAL_SMERBCAPR_THRESH_WIDTH      (24U)
#define ENETC_GLOBAL_SMERBCAPR_THRESH(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBCAPR_THRESH_SHIFT)) & ENETC_GLOBAL_SMERBCAPR_THRESH_MASK)

#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_MASK    (0x30000000U)
#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT   (28U)
#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_WIDTH   (2U)
#define ENETC_GLOBAL_SMERBCAPR_WORD_SIZE(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_SHIFT)) & ENETC_GLOBAL_SMERBCAPR_WORD_SIZE_MASK)

#define ENETC_GLOBAL_SMERBCAPR_MLOC_MASK         (0xC0000000U)
#define ENETC_GLOBAL_SMERBCAPR_MLOC_SHIFT        (30U)
#define ENETC_GLOBAL_SMERBCAPR_MLOC_WIDTH        (2U)
#define ENETC_GLOBAL_SMERBCAPR_MLOC(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBCAPR_MLOC_SHIFT)) & ENETC_GLOBAL_SMERBCAPR_MLOC_MASK)
/*! @} */

/*! @name SMERBOR0 - Shared memory ENETC receive buffer operational register 0 */
/*! @{ */

#define ENETC_GLOBAL_SMERBOR0_AMOUNT_MASK        (0xFFFFFFU)
#define ENETC_GLOBAL_SMERBOR0_AMOUNT_SHIFT       (0U)
#define ENETC_GLOBAL_SMERBOR0_AMOUNT_WIDTH       (24U)
#define ENETC_GLOBAL_SMERBOR0_AMOUNT(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBOR0_AMOUNT_SHIFT)) & ENETC_GLOBAL_SMERBOR0_AMOUNT_MASK)
/*! @} */

/*! @name SMERBOR1 - Shared memory ENETC receive buffer operational 1 */
/*! @{ */

#define ENETC_GLOBAL_SMERBOR1_WATERMARK_MASK     (0xFFFFFFU)
#define ENETC_GLOBAL_SMERBOR1_WATERMARK_SHIFT    (0U)
#define ENETC_GLOBAL_SMERBOR1_WATERMARK_WIDTH    (24U)
#define ENETC_GLOBAL_SMERBOR1_WATERMARK(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_SMERBOR1_WATERMARK_SHIFT)) & ENETC_GLOBAL_SMERBOR1_WATERMARK_MASK)
/*! @} */

/*! @name PCEOR - PCE 0 operational register */
/*! @{ */

#define ENETC_GLOBAL_PCEOR_NUM_FRAMES_MASK       (0x7FU)
#define ENETC_GLOBAL_PCEOR_NUM_FRAMES_SHIFT      (0U)
#define ENETC_GLOBAL_PCEOR_NUM_FRAMES_WIDTH      (7U)
#define ENETC_GLOBAL_PCEOR_NUM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_PCEOR_NUM_FRAMES_SHIFT)) & ENETC_GLOBAL_PCEOR_NUM_FRAMES_MASK)

#define ENETC_GLOBAL_PCEOR_HWM_FRAMES_MASK       (0x7F00U)
#define ENETC_GLOBAL_PCEOR_HWM_FRAMES_SHIFT      (8U)
#define ENETC_GLOBAL_PCEOR_HWM_FRAMES_WIDTH      (7U)
#define ENETC_GLOBAL_PCEOR_HWM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_PCEOR_HWM_FRAMES_SHIFT)) & ENETC_GLOBAL_PCEOR_HWM_FRAMES_MASK)

#define ENETC_GLOBAL_PCEOR_MAX_FRAMES_MASK       (0x7F0000U)
#define ENETC_GLOBAL_PCEOR_MAX_FRAMES_SHIFT      (16U)
#define ENETC_GLOBAL_PCEOR_MAX_FRAMES_WIDTH      (7U)
#define ENETC_GLOBAL_PCEOR_MAX_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_PCEOR_MAX_FRAMES_SHIFT)) & ENETC_GLOBAL_PCEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name RFEOR - Replication Forwarding Engine 0 operational register */
/*! @{ */

#define ENETC_GLOBAL_RFEOR_NUM_FRAMES_MASK       (0x3FU)
#define ENETC_GLOBAL_RFEOR_NUM_FRAMES_SHIFT      (0U)
#define ENETC_GLOBAL_RFEOR_NUM_FRAMES_WIDTH      (6U)
#define ENETC_GLOBAL_RFEOR_NUM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RFEOR_NUM_FRAMES_SHIFT)) & ENETC_GLOBAL_RFEOR_NUM_FRAMES_MASK)

#define ENETC_GLOBAL_RFEOR_HWM_FRAMES_MASK       (0x3F00U)
#define ENETC_GLOBAL_RFEOR_HWM_FRAMES_SHIFT      (8U)
#define ENETC_GLOBAL_RFEOR_HWM_FRAMES_WIDTH      (6U)
#define ENETC_GLOBAL_RFEOR_HWM_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RFEOR_HWM_FRAMES_SHIFT)) & ENETC_GLOBAL_RFEOR_HWM_FRAMES_MASK)

#define ENETC_GLOBAL_RFEOR_MAX_FRAMES_MASK       (0x3F0000U)
#define ENETC_GLOBAL_RFEOR_MAX_FRAMES_SHIFT      (16U)
#define ENETC_GLOBAL_RFEOR_MAX_FRAMES_WIDTH      (6U)
#define ENETC_GLOBAL_RFEOR_MAX_FRAMES(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RFEOR_MAX_FRAMES_SHIFT)) & ENETC_GLOBAL_RFEOR_MAX_FRAMES_MASK)
/*! @} */

/*! @name NETCCLKR - NETC clock register */
/*! @{ */

#define ENETC_GLOBAL_NETCCLKR_FREQ_MASK          (0x7FFU)
#define ENETC_GLOBAL_NETCCLKR_FREQ_SHIFT         (0U)
#define ENETC_GLOBAL_NETCCLKR_FREQ_WIDTH         (11U)
#define ENETC_GLOBAL_NETCCLKR_FREQ(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_NETCCLKR_FREQ_SHIFT)) & ENETC_GLOBAL_NETCCLKR_FREQ_MASK)
/*! @} */

/*! @name HTACAPR - HTA 0 capability register */
/*! @{ */

#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK  (0xFFU)
#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT (0U)
#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_WIDTH (8U)
#define ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_SHIFT)) & ENETC_GLOBAL_HTACAPR_MAX_RX_FRAMES_MASK)

#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK  (0xFF00U)
#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT (8U)
#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_WIDTH (8U)
#define ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_SHIFT)) & ENETC_GLOBAL_HTACAPR_MAX_TX_FRAMES_MASK)
/*! @} */

/*! @name HTARFCOR - HTA 0 receive frame count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTARFCOR_HP_COUNT_MASK      (0xFFU)
#define ENETC_GLOBAL_HTARFCOR_HP_COUNT_SHIFT     (0U)
#define ENETC_GLOBAL_HTARFCOR_HP_COUNT_WIDTH     (8U)
#define ENETC_GLOBAL_HTARFCOR_HP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_HP_COUNT_SHIFT)) & ENETC_GLOBAL_HTARFCOR_HP_COUNT_MASK)

