zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_GLOBAL.h
#define ENETC_GLOBAL_HTARFCOR_HP_HWM_MASK        (0xFF00U)
#define ENETC_GLOBAL_HTARFCOR_HP_HWM_SHIFT       (8U)
#define ENETC_GLOBAL_HTARFCOR_HP_HWM_WIDTH       (8U)
#define ENETC_GLOBAL_HTARFCOR_HP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_HP_HWM_SHIFT)) & ENETC_GLOBAL_HTARFCOR_HP_HWM_MASK)

#define ENETC_GLOBAL_HTARFCOR_LP_COUNT_MASK      (0xFF0000U)
#define ENETC_GLOBAL_HTARFCOR_LP_COUNT_SHIFT     (16U)
#define ENETC_GLOBAL_HTARFCOR_LP_COUNT_WIDTH     (8U)
#define ENETC_GLOBAL_HTARFCOR_LP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_LP_COUNT_SHIFT)) & ENETC_GLOBAL_HTARFCOR_LP_COUNT_MASK)

#define ENETC_GLOBAL_HTARFCOR_LP_HWM_MASK        (0xFF000000U)
#define ENETC_GLOBAL_HTARFCOR_LP_HWM_SHIFT       (24U)
#define ENETC_GLOBAL_HTARFCOR_LP_HWM_WIDTH       (8U)
#define ENETC_GLOBAL_HTARFCOR_LP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTARFCOR_LP_HWM_SHIFT)) & ENETC_GLOBAL_HTARFCOR_LP_HWM_MASK)
/*! @} */

/*! @name HTAHPBCOR - HTA 0 high priority byte count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_MASK     (0xFFFFU)
#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT    (0U)
#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_WIDTH    (16U)
#define ENETC_GLOBAL_HTAHPBCOR_HP_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_SHIFT)) & ENETC_GLOBAL_HTAHPBCOR_HP_COUNT_MASK)

#define ENETC_GLOBAL_HTAHPBCOR_HWM_MASK          (0xFFFF0000U)
#define ENETC_GLOBAL_HTAHPBCOR_HWM_SHIFT         (16U)
#define ENETC_GLOBAL_HTAHPBCOR_HWM_WIDTH         (16U)
#define ENETC_GLOBAL_HTAHPBCOR_HWM(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTAHPBCOR_HWM_SHIFT)) & ENETC_GLOBAL_HTAHPBCOR_HWM_MASK)
/*! @} */

/*! @name HTALPBCOR - HTA 0 low priority byte count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT_MASK     (0xFFFFU)
#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT    (0U)
#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT_WIDTH    (16U)
#define ENETC_GLOBAL_HTALPBCOR_LP_COUNT(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTALPBCOR_LP_COUNT_SHIFT)) & ENETC_GLOBAL_HTALPBCOR_LP_COUNT_MASK)

#define ENETC_GLOBAL_HTALPBCOR_HWM_MASK          (0xFFFF0000U)
#define ENETC_GLOBAL_HTALPBCOR_HWM_SHIFT         (16U)
#define ENETC_GLOBAL_HTALPBCOR_HWM_WIDTH         (16U)
#define ENETC_GLOBAL_HTALPBCOR_HWM(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTALPBCOR_HWM_SHIFT)) & ENETC_GLOBAL_HTALPBCOR_HWM_MASK)
/*! @} */

/*! @name HTATFCOR - HTA 0 transmit frame count operational register */
/*! @{ */

#define ENETC_GLOBAL_HTATFCOR_HP_COUNT_MASK      (0xFFU)
#define ENETC_GLOBAL_HTATFCOR_HP_COUNT_SHIFT     (0U)
#define ENETC_GLOBAL_HTATFCOR_HP_COUNT_WIDTH     (8U)
#define ENETC_GLOBAL_HTATFCOR_HP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_HP_COUNT_SHIFT)) & ENETC_GLOBAL_HTATFCOR_HP_COUNT_MASK)

#define ENETC_GLOBAL_HTATFCOR_HP_HWM_MASK        (0xFF00U)
#define ENETC_GLOBAL_HTATFCOR_HP_HWM_SHIFT       (8U)
#define ENETC_GLOBAL_HTATFCOR_HP_HWM_WIDTH       (8U)
#define ENETC_GLOBAL_HTATFCOR_HP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_HP_HWM_SHIFT)) & ENETC_GLOBAL_HTATFCOR_HP_HWM_MASK)

#define ENETC_GLOBAL_HTATFCOR_LP_COUNT_MASK      (0xFF0000U)
#define ENETC_GLOBAL_HTATFCOR_LP_COUNT_SHIFT     (16U)
#define ENETC_GLOBAL_HTATFCOR_LP_COUNT_WIDTH     (8U)
#define ENETC_GLOBAL_HTATFCOR_LP_COUNT(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_LP_COUNT_SHIFT)) & ENETC_GLOBAL_HTATFCOR_LP_COUNT_MASK)

#define ENETC_GLOBAL_HTATFCOR_LP_HWM_MASK        (0xFF000000U)
#define ENETC_GLOBAL_HTATFCOR_LP_HWM_SHIFT       (24U)
#define ENETC_GLOBAL_HTATFCOR_LP_HWM_WIDTH       (8U)
#define ENETC_GLOBAL_HTATFCOR_LP_HWM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_HTATFCOR_LP_HWM_SHIFT)) & ENETC_GLOBAL_HTATFCOR_LP_HWM_MASK)
/*! @} */

/*! @name RCSBRLAR - Root complex 0 system bus read latency average register */
/*! @{ */

#define ENETC_GLOBAL_RCSBRLAR_FRACT_MASK         (0xFFU)
#define ENETC_GLOBAL_RCSBRLAR_FRACT_SHIFT        (0U)
#define ENETC_GLOBAL_RCSBRLAR_FRACT_WIDTH        (8U)
#define ENETC_GLOBAL_RCSBRLAR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLAR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBRLAR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBRLAR_INT_MASK           (0xFFF00U)
#define ENETC_GLOBAL_RCSBRLAR_INT_SHIFT          (8U)
#define ENETC_GLOBAL_RCSBRLAR_INT_WIDTH          (12U)
#define ENETC_GLOBAL_RCSBRLAR_INT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLAR_INT_SHIFT)) & ENETC_GLOBAL_RCSBRLAR_INT_MASK)
/*! @} */

/*! @name RCSBRLHWMR - Root complex 0 system bus read latency high watermark register */
/*! @{ */

#define ENETC_GLOBAL_RCSBRLHWMR_FRACT_MASK       (0xFFU)
#define ENETC_GLOBAL_RCSBRLHWMR_FRACT_SHIFT      (0U)
#define ENETC_GLOBAL_RCSBRLHWMR_FRACT_WIDTH      (8U)
#define ENETC_GLOBAL_RCSBRLHWMR_FRACT(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLHWMR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBRLHWMR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBRLHWMR_INT_MASK         (0xFFF00U)
#define ENETC_GLOBAL_RCSBRLHWMR_INT_SHIFT        (8U)
#define ENETC_GLOBAL_RCSBRLHWMR_INT_WIDTH        (12U)
#define ENETC_GLOBAL_RCSBRLHWMR_INT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBRLHWMR_INT_SHIFT)) & ENETC_GLOBAL_RCSBRLHWMR_INT_MASK)
/*! @} */

/*! @name RCSBWLAR - Root complex 0 system bus write latency average register */
/*! @{ */

#define ENETC_GLOBAL_RCSBWLAR_FRACT_MASK         (0xFFU)
#define ENETC_GLOBAL_RCSBWLAR_FRACT_SHIFT        (0U)
#define ENETC_GLOBAL_RCSBWLAR_FRACT_WIDTH        (8U)
#define ENETC_GLOBAL_RCSBWLAR_FRACT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLAR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBWLAR_FRACT_MASK)

#define ENETC_GLOBAL_RCSBWLAR_INT_MASK           (0xFFF00U)
#define ENETC_GLOBAL_RCSBWLAR_INT_SHIFT          (8U)
#define ENETC_GLOBAL_RCSBWLAR_INT_WIDTH          (12U)
#define ENETC_GLOBAL_RCSBWLAR_INT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLAR_INT_SHIFT)) & ENETC_GLOBAL_RCSBWLAR_INT_MASK)
/*! @} */

/*! @name RCSBWLHWMR - Root complex 0 system bus write latency high watermark register */
/*! @{ */

#define ENETC_GLOBAL_RCSBWLHWMR_FRACT_MASK       (0xFFU)
#define ENETC_GLOBAL_RCSBWLHWMR_FRACT_SHIFT      (0U)
#define ENETC_GLOBAL_RCSBWLHWMR_FRACT_WIDTH      (8U)
#define ENETC_GLOBAL_RCSBWLHWMR_FRACT(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLHWMR_FRACT_SHIFT)) & ENETC_GLOBAL_RCSBWLHWMR_FRACT_MASK)

