zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_GLOBAL.h
#define ENETC_GLOBAL_RCSBWLHWMR_INT_MASK         (0xFFF00U)
#define ENETC_GLOBAL_RCSBWLHWMR_INT_SHIFT        (8U)
#define ENETC_GLOBAL_RCSBWLHWMR_INT_WIDTH        (12U)
#define ENETC_GLOBAL_RCSBWLHWMR_INT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_RCSBWLHWMR_INT_SHIFT)) & ENETC_GLOBAL_RCSBWLHWMR_INT_MASK)
/*! @} */

/*! @name IPBRR0 - IP block revision register 0 */
/*! @{ */

#define ENETC_GLOBAL_IPBRR0_IP_MN_MASK           (0xFFU)
#define ENETC_GLOBAL_IPBRR0_IP_MN_SHIFT          (0U)
#define ENETC_GLOBAL_IPBRR0_IP_MN_WIDTH          (8U)
#define ENETC_GLOBAL_IPBRR0_IP_MN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR0_IP_MN_SHIFT)) & ENETC_GLOBAL_IPBRR0_IP_MN_MASK)

#define ENETC_GLOBAL_IPBRR0_IP_MJ_MASK           (0xFF00U)
#define ENETC_GLOBAL_IPBRR0_IP_MJ_SHIFT          (8U)
#define ENETC_GLOBAL_IPBRR0_IP_MJ_WIDTH          (8U)
#define ENETC_GLOBAL_IPBRR0_IP_MJ(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR0_IP_MJ_SHIFT)) & ENETC_GLOBAL_IPBRR0_IP_MJ_MASK)
/*! @} */

/*! @name IPBRR1 - IP block revision register 1 */
/*! @{ */

#define ENETC_GLOBAL_IPBRR1_IP_CFG_MASK          (0xFFU)
#define ENETC_GLOBAL_IPBRR1_IP_CFG_SHIFT         (0U)
#define ENETC_GLOBAL_IPBRR1_IP_CFG_WIDTH         (8U)
#define ENETC_GLOBAL_IPBRR1_IP_CFG(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR1_IP_CFG_SHIFT)) & ENETC_GLOBAL_IPBRR1_IP_CFG_MASK)

#define ENETC_GLOBAL_IPBRR1_IP_MNT_MASK          (0xFF00U)
#define ENETC_GLOBAL_IPBRR1_IP_MNT_SHIFT         (8U)
#define ENETC_GLOBAL_IPBRR1_IP_MNT_WIDTH         (8U)
#define ENETC_GLOBAL_IPBRR1_IP_MNT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR1_IP_MNT_SHIFT)) & ENETC_GLOBAL_IPBRR1_IP_MNT_MASK)

#define ENETC_GLOBAL_IPBRR1_IP_INT_MASK          (0xFF0000U)
#define ENETC_GLOBAL_IPBRR1_IP_INT_SHIFT         (16U)
#define ENETC_GLOBAL_IPBRR1_IP_INT_WIDTH         (8U)
#define ENETC_GLOBAL_IPBRR1_IP_INT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_IPBRR1_IP_INT_SHIFT)) & ENETC_GLOBAL_IPBRR1_IP_INT_MASK)
/*! @} */

/*! @name FBLPR - Function boot loader parameter register 0..Function boot loader parameter register 1 */
/*! @{ */

#define ENETC_GLOBAL_FBLPR_PARAM_VAL_MASK        (0xFFFFFFFFU)
#define ENETC_GLOBAL_FBLPR_PARAM_VAL_SHIFT       (0U)
#define ENETC_GLOBAL_FBLPR_PARAM_VAL_WIDTH       (32U)
#define ENETC_GLOBAL_FBLPR_PARAM_VAL(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_GLOBAL_FBLPR_PARAM_VAL_SHIFT)) & ENETC_GLOBAL_FBLPR_PARAM_VAL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_GLOBAL_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_GLOBAL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_GLOBAL_H_) */
